# Практическая работа. Обработка текстовых файлов в .NET

## Тема

Обработка текстовых файлов в C# с использованием классов `File`, `StreamReader`, `StreamWriter`. Чтение, запись, добавление и анализ текстовых данных.

## Цель

Научить студентов:

1. Создавать и открывать текстовые файлы.
2. Чтение и запись текстовой информации в файлы.
3. Использовать потоковую обработку для работы с текстовыми файлами.
4. Разрабатывать простые программы для анализа и обработки текстовых данных.

---

## Теоретическая часть

### 1. Работа с текстовыми файлами

В .NET для работы с текстовыми файлами используют следующие подходы:

* **Статические методы класса `File`**: удобны для быстрой записи и чтения небольших файлов.

  * `File.WriteAllText(path, text)` — запись строки в файл.
  * `File.ReadAllText(path)` — чтение содержимого файла целиком.
  * `File.AppendAllText(path, text)` — добавление текста в конец файла.
* **Классы потоков**: `StreamReader` и `StreamWriter` позволяют работать с файлами построчно, что полезно для больших файлов.

  * `StreamReader.ReadLine()` — чтение строки.
  * `StreamWriter.WriteLine(text)` — запись строки в файл.

### 2. Потоковая обработка

Использование потоков позволяет экономить память, так как данные читаются и записываются постепенно, а не целиком. Также потоки безопасно освобождают ресурсы через конструкцию `using`.

### 3. Применение

Текстовые файлы применяются для хранения логов, конфигураций, отчётов, простых баз данных, а также обмена данными между приложениями.

---

## Ход работы

1. Выбрать вариант задания по номеру в журнале.
2. Создать новый проект C# (.NET Core или .NET 6/7/8 Console Application).
3. В папке проекта создать текстовые файлы для обработки (например, `input.txt`).
4. Написать программу, реализующую требуемые функции.
5. Протестировать программу, проверить корректность работы.
6. Сделать скриншоты работы программы и поместить их в папку `images`.
7. Оформить `readme.md` с номером работы, вариантом, текстом задания и кодом с подсветкой.
8. Подготовить репозиторий для сдачи (проект + `images` + `readme.md`).

---

## Практический пример

**Пример задания:** Программа читает текстовый файл `input.txt`, подсчитывает количество слов и строк, записывает результат в файл `output.txt`.

```csharp
using System;
using System.IO;

class Program
{
    static void Main()
    {
        string inputPath = "input.txt";
        string outputPath = "output.txt";

        if (!File.Exists(inputPath))
        {
            Console.WriteLine("Файл input.txt не найден.");
            return;
        }

        string[] lines = File.ReadAllLines(inputPath);
        int lineCount = lines.Length;
        int wordCount = 0;

        foreach (string line in lines)
        {
            wordCount += line.Split(' ', StringSplitOptions.RemoveEmptyEntries).Length;
        }

        string result = $"Количество строк: {lineCount}\nКоличество слов: {wordCount}";
        File.WriteAllText(outputPath, result);

        Console.WriteLine("Обработка завершена. Результат сохранен в output.txt");
    }
}
```

---

## 15 вариантов простых заданий

Вариант выбирается по номеру в журнале:

1. Подсчитать количество строк в файле.
2. Подсчитать количество слов в файле.
3. Подсчитать количество символов в файле.
4. Найти самое длинное слово в файле.
5. Найти самое короткое слово в файле.
6. Подсчитать количество гласных букв в файле.
7. Подсчитать количество согласных букв в файле.
8. Скопировать содержимое файла в новый файл.
9. Обратить порядок строк в файле.
10. Заменить все вхождения заданного слова на другое.
11. Вывести все строки, содержащие определенное слово.
12. Удалить пустые строки из файла.
13. Создать файл, содержащий только первые N строк исходного файла.
14. Сортировать строки файла в алфавитном порядке.
15. Подсчитать количество повторений каждого слова в файле.

---

## Критерии оценки

| Оценка | Критерий                                                                                                                                                                                                                |
| ------ | ----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |
| 2      | Программа частично работает, есть ошибки при выполнении.                                                                                                                                                                |
| 3      | Программа выполняет задание, но возможны некорректные результаты для отдельных случаев.                                                                                                                                 |
| 4      | Программа корректно выполняет задание, код оформлен понятно, есть комментарии.                                                                                                                                          |
| 5      | Программа полностью соответствует заданию, корректно обрабатывает все случаи, использованы потоки, код структурирован, добавлены дополнительные проверки, оформление в `readme.md` полностью соответствует требованиям. |

---

## Контрольные вопросы

1. Чем отличаются методы `ReadAllText` и `ReadAllLines`?
2. Когда следует использовать `StreamReader` вместо `File.ReadAllText`?
3. Как добавить строку в конец файла без перезаписи содержимого?
4. Как подсчитать количество слов в строке?
5. Как безопасно закрыть поток после работы с файлом?
6. Что произойдет, если файл для записи не существует?
7. Как использовать `using` для потоков и зачем это нужно?
8. Какие ошибки могут возникнуть при работе с файлами и как их обрабатывать?

---

## Структура репозитория

```
Практическая_работа_№X/
├─ MyFileApp/              # Проект C# (.NET Console Application)
│   ├─ Program.cs
│   ├─ input.txt
│   ├─ output.txt
│   └─ ... (другие файлы проекта)
├─ images/                 # Скриншоты работы программы
│   ├─ screenshot1.png
│   └─ screenshot2.png
└─ readme.md               # Описание работы
```

---

## Содержание файла `readme.md` (пример)

````markdown
# Практическая работа №X
## Обработка текстовых файлов
### Вариант: 3
**Задание:** Подсчитать количество символов в файле и сохранить результат в новый файл.

### Пример кода:

```csharp
using System;
using System.IO;

class Program
{
    static void Main()
    {
        string inputPath = "input.txt";
        string outputPath = "output.txt";

        if (!File.Exists(inputPath))
        {
            Console.WriteLine("Файл input.txt не найден.");
            return;
        }

        string content = File.ReadAllText(inputPath);
        int charCount = content.Length;

        File.WriteAllText(outputPath, $"Количество символов: {charCount}");
        Console.WriteLine("Обработка завершена. Результат сохранен в output.txt");
    }
}
````

```